In [1]:
import pandas as pd

In [2]:
import atoti as tt

Welcome to atoti 0.7.1!

By using this community edition, you agree with the license available at https://docs.atoti.io/latest/eula.html.
Browse the official documentation at https://docs.atoti.io.
Join the community at https://www.atoti.io/register.

atoti collects telemetry data, which is used to help understand how to improve the product.
If you don't wish to send usage data, set the ATOTI_DISABLE_TELEMETRY environment variable to True.

You can hide this message by setting the ATOTI_HIDE_EULA_MESSAGE environment variable to True.

### Load Data

In [3]:
std_asses_frame = pd.read_csv('data/studentAssessment.csv')

In [4]:
std_info_frame = pd.read_csv('data/studentInfo.csv')

In [5]:
assesments_frame = pd.read_csv('data/assessments.csv')

#### Ambil features yang dikehendaki untuk dianalisis

In [6]:
stdAsses = pd.DataFrame(std_asses_frame, columns=['id_student','id_assesment','score'])
stdAsses.head(5)

   id_student  id_assesment  score
0       11391           NaN   78.0
1       28400           NaN   70.0
2       31604           NaN   72.0
3       32885           NaN   69.0
4       38053           NaN   79.0

In [7]:
stdInfo = pd.DataFrame(std_info_frame, columns=['code_module','code_presentation','id_student', 'final_result', 'num_of_prev_attempts', 'highest_education'])
stdInfo.head(5)

,code_module,code_presentation,id_student,final_result,num_of_prev_attempts,highest_education
0,AAA,2013J,11391,Pass,0,HE Qualification
1,AAA,2013J,28400,Pass,0,HE Qualification
2,AAA,2013J,30268,Withdrawn,0,A Level or Equivalent
3,AAA,2013J,31604,Pass,0,A Level or Equivalent
4,AAA,2013J,32885,Pass,0,Lower Than A Level

In [9]:
asses = pd.DataFrame(assesments_frame, columns=['code_module','code_presentation','id_assesment', 'assesment_type', 'date'])
asses.head(5)

  code_module code_presentation  id_assesment  assesment_type   date
0         AAA             2013J           NaN             NaN   19.0
1         AAA             2013J           NaN             NaN   54.0
2         AAA             2013J           NaN             NaN  117.0
3         AAA             2013J           NaN             NaN  166.0
4         AAA             2013J           NaN             NaN  215.0